Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Клиенты</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ДатаРождения</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Телефон</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Email</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Telegram</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>TelegramID</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаРегистрации</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СтатусКлиента</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыКлиентов</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыКлиентов</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ИсточникПривлечения</Name>
      <ValueType><v8:Type>cfg:EnumRef.ИсточникиПривлечения</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ИсточникиПривлечения</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ОтветственныйМенеджер</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Пользователи</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СогласиеНаУведомления</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СогласиеНаОбработкуДанных</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыКлиентов</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Потенциальный</Name>
    </Value>
    <Value>
      <Name>Активный</Name>
    </Value>
    <Value>
      <Name>Приостановлен</Name>
    </Value>
    <Value>
      <Name>Архивный</Name>
    </Value>
  </Properties>
</MetaDataObject>

Catalogs/Клиенты/Ext/ObjectModule.bsl
// Модуль справочника Клиенты

Процедура ОбработкаУдаления(Отказ)
	// Аудит удаления/архивирования клиента
	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Архивирование клиента", "", Строка(СтатусКлиента));
КонецПроцедуры

Процедура ОбработкаЗаписиНового(Отказ)
	Если ПустоеЗначение(ДатаРегистрации) Тогда
		ДатаРегистрации = ТекущаяДата();
	КонецЕсли;
	Если ПустоеЗначение(СтатусКлиента) Тогда
		СтатусКлиента = Перечисления.СтатусыКлиентов.Потенциальный;
	КонецЕсли;
КонецПроцедуры
